
nc: 80  # number of classes
scales: # 
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]
backbone:
  - [-1, 1, efficientformerv2_s0, []]  # 4


head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 5 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 6
  - [-1, 1, Conv, [256, 1, 1]]  # 7, Y5, lateral_convs.0


  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 8
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]  #9 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 10
  - [-1, 3, RepC3, [256, 0.5]]  # 11, fpn_blocks.0
  - [-1, 1, Conv, [128, 1, 1]]   # 12, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [1, 1, SPDConv, [128]] # 14
  - [[-1, -2, 2], 1, Concat, [1]] # 15
  - [-1, 1, DDF, []] # 16
  - [-1, 3, RepC3, [256, 0.5]] # 17

  - [-1, 1, Conv, [256, 3, 2]]   # 18, downsample_convs.0
  - [[-1, 12], 1, Concat, [1]] # 19
  - [-1, 3, RepC3, [256, 0.5]] # 20
  
  - [-1, 1, Conv, [256, 3, 2]]   # 21, downsample_convs.0
  - [[-1, 7], 1, Concat, [1]] # 22
  - [-1, 3, RepC3, [256, 0.5]] # 23
  

  - [[17, 20, 23], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # RTDETRDecoder(P3, P4, P5)